---
kind: method
id: M:Autodesk.Revit.UI.IRevisionsOnSheetUIServer.ShowDialog(Autodesk.Revit.UI.RevisionsOnSheetUIServiceData)
source: html/97ce5b29-ff5b-7d8a-f5aa-b7de7630c456.htm
---
# Autodesk.Revit.UI.IRevisionsOnSheetUIServer.ShowDialog Method

Shows dialog on managing RevisionsOnSheetUI.

## Syntax (C#)
```csharp
bool ShowDialog(
	RevisionsOnSheetUIServiceData data
)
```

## Parameters
- **data** (`Autodesk.Revit.UI.RevisionsOnSheetUIServiceData`) - The data on initializing the dialog as well as getting the result.

## Returns
Whether or not the dialog launches successfully